#+Title: Workflow for: Century-scale hindcasting of glacier flux using ice-rafted debris: A step toward improved model initialisation
#+Author: Signe Hillerup Larsen
# #+OPTIONS:   H:4 num:4 toc:nil \n:nil ::t |:t ^:{} -:t f:t *:t <:t

# #+PROPERTY: header-args: :tangle no :noweb yes :eval no
# #+PROPERTY: header-args:jupyter-python :kernel dynahide_v3 :session dynahide_v3 :eval no :noweb yes :comments both :tangle no :tangle-mode (identity #o544)

#+PROPERTY: header-args:python :eval yes :noweb yes :session dynahide_v4_python
#+PROPERTY: header-args:bash :session dynahide_v4 :noweb yes


***** Code
#+NAME: greenland_resolution
#+BEGIN_SRC bash
xres=1000
yres=1000
xmin=-593725
ymin=-3331123
xmax=855521
ymax=-815550
#+END_SRC

#+RESULTS: greenland_resolution

#+NAME: greenland_geometry
#+BEGIN_SRC bash :results verbatim
DATA=$DATADIR/Morlighem_2022/BedMachineGreenland-v5.nc
variab=thickness
shortname=thk
gdalwarp -of netCDF -r near -t_srs "+proj=stere +lat_0=90 +lat_ts=70 +lon_0=-45 +k=1 +x_0=0 +y_0=0 +datum=WGS84 +units=m +no_defs" -te $xmin $ymin $xmax $ymax -tr $xres $yres NETCDF:${DATA}:$variab tmp.nc -overwrite
ncks -O -v Band1 tmp.nc $WORKING
ncap2 -s 'thk=float(Band1)' $WORKING $WORKING -O
ncap2 -s 'where(thk<0) thk=0' $WORKING $WORKING -O
ncatted -a standard_name,$shortname,d,, $WORKING # remove it
ncatted -O -a units,$shortname,o,c,"m" $WORKING
ncatted -O -a long_name,$shortname,o,c,"Ice sheet thickness" $WORKING
rm tmp.nc

variab=bed
shortname=topg
gdalwarp -of netCDF -t_srs "+proj=stere +lat_0=90 +lat_ts=70 +lon_0=-45 +k=1 +x_0=0 +y_0=0 +datum=WGS84 +units=m +no_defs" -r near -te $xmin $ymin $xmax $ymax -tr $xres $yres NETCDF:${DATA}:$variab tmp.nc -overwrite
ncks -A -v Band1 tmp.nc $WORKING
ncap2 -s 'topg=float(Band1)' $WORKING $WORKING -O
ncatted -a standard_name,$shortname,d,, $WORKING # remove it
ncatted -O -a units,$shortname,o,c,"m" $WORKING
ncatted -O -a long_name,$shortname,o,c,"Bedrock topography" $WORKING
rm tmp.nc

variab=surface
shortname=usurf
gdalwarp -of netCDF -t_srs "+proj=stere +lat_0=90 +lat_ts=70 +lon_0=-45 +k=1 +x_0=0 +y_0=0 +datum=WGS84 +units=m +no_defs" -r near -te $xmin $ymin $xmax $ymax -tr $xres $yres NETCDF:${DATA}:$variab tmp.nc -overwrite
ncks -A -v Band1 tmp.nc $WORKING
ncap2 -s 'usurf=float(Band1)' $WORKING $WORKING -O
ncatted -a standard_name,$shortname,d,, $WORKING # remove it
ncatted -O -a units,$shortname,o,c,"m" $WORKING
ncatted -O -a long_name,$shortname,o,c,"Ice surface elevation" $WORKING
rm tmp.nc


 #+END_SRC


#+NAME: greenland_heatflux
#+BEGIN_SRC bash
DATA=$PISM_EXAMPLEDIR/jako/gr1km.nc #geothermal_heat_greenland.nc #
variab=bheatflx #Band1 #
shortname=bheatflx
gdalwarp -of netCDF -t_srs "+proj=stere +lat_0=90 +lat_ts=70 +lon_0=-45 +k=1 +x_0=0 +y_0=0 +datum=WGS84 +units=m +no_defs" -r bilinear -srcnodata none -te $xmin $ymin $xmax $ymax -tr $xres $yres NETCDF:${DATA}:$variab tmp.nc -overwrite
ncap2 -s 'Band1=double(Band1);' $WORKING $WORKING -O
ncks -A -v Band1 tmp.nc $WORKING 
ncap2 -s 'bheatflx=float(Band1)' $WORKING $WORKING -O
#ncrename -v Band1,$shortname $WORKING
ncatted -a standard_name,$shortname,d,, $WORKING # remove it
ncatted -O -a units,$shortname,o,c,"mW/m²" $WORKING
ncatted -O -a long_name,$shortname,o,c,"Basal Heat Flux" $WORKING
rm tmp.nc
 #+END_SRC

#+NAME: greenland_climate
#+BEGIN_SRC bash
DATA=$PISM_EXAMPLEDIR/std-greenland/Greenland_5km_v1.1.nc

variab=presprcp
shortname=precipitation
gdalwarp -of netCDF -t_srs "+proj=stere +lat_0=90 +lat_ts=70 +lon_0=-45 +k=1 +x_0=0 +y_0=0 +datum=WGS84 +units=m +no_defs" -r bilinear -dstnodata none -te $xmin $ymin $xmax $ymax -tr $xres $yres NETCDF:${DATA}:$variab tmp.nc -overwrite
ncks -A -v Band1 tmp.nc $WORKING
ncap2 -O -s "precipitation=Band1*1000.0" $WORKING $WORKING
ncatted -a standard_name,$shortname,d,, $WORKING # remove it
ncatted -O -a units,$shortname,o,c,"kg m-2 year-1" $WORKING
ncatted -O -a long_name,$shortname,c,c,"mean annual precipitation rate" $WORKING
rm tmp.nc

variab=airtemp2m
shortname=ice_surface_temp
gdalwarp -of netCDF -t_srs "+proj=stere +lat_0=90 +lat_ts=70 +lon_0=-45 +k=1 +x_0=0 +y_0=0 +datum=WGS84 +units=m +no_defs" -r bilinear -te $xmin $ymin $xmax $ymax -tr $xres $yres NETCDF:${DATA}:$variab tmp.nc -overwrite
ncks -A -v Band1 tmp.nc $WORKING
ncrename -O -v Band1,$shortname $WORKING
ncatted -O -a units,$shortname,o,c,"Celsius" $WORKING
ncatted -O -a long_name,$shortname,c,c,"2 m air temp used as surface temp" $WORKING
rm tmp.nc

variab=smb
shortname=climatic_mass_balance
gdalwarp -of netCDF -t_srs "+proj=stere +lat_0=90 +lat_ts=70 +lon_0=-45 +k=1 +x_0=0 +y_0=0 +datum=WGS84 +units=m +no_defs" -r bilinear -te $xmin $ymin $xmax $ymax -tr $xres $yres NETCDF:${DATA}:$variab tmp.nc -overwrite
ncks -A -v Band1 tmp.nc $WORKING
ncap2 -O -s "climatic_mass_balance=1000.0*Band1" $WORKING $WORKING
ncap2 -O -s "where(thk <= 0.0){climatic_mass_balance=-1000.0;}" $WORKING $WORKING
ncatted -O -a standard_name,$shortname,m,c,"land_ice_surface_specific_mass_balance_flux" $WORKING
ncatted -O -a units,$shortname,m,c,"kg m-2 year-1" $WORKING
rm tmp.nc
#+END_SRC
-a_srs "+proj=stere +lat_0=90 +lat_ts=70 +lon_0=-45 +k=1 +x_0=0 +y_0=0 +datum=WGS84 +units=m +no_defs"
-of netCDF


#+BEGIN_SRC python
import geopandas as gpd

# Load the shapefile
gdf = gpd.read_file('shp/catchment_jan2021.shp')

# Set the CRS (Coordinate Reference System)
gdf.crs = "+proj=stere +lat_0=90 +lat_ts=70 +lon_0=-45 +k=1 +x_0=0 +y_0=0 +datum=WGS84 +units=m +no_defs"  # Replace with your desired CRS

# Write out the modified shapefile
gdf.to_file('shp/catchment_jan2021_3413.shp')

#+END_SRC

#+RESULTS:
-a_srs "+proj=stere +lat_0=90 +lat_ts=70 +lon_0=-45 +k=1 +x_0=0 +y_0=0 +datum=WGS84 +units=m +no_defs"

#+NAME: rasterize_ftt_mask_to_helheim_nc
 #+BEGIN_SRC bash :results verbatim
# This only works in python 2.7 due to the old netcdf3_classic format of the pism file
gdal_rasterize -burn 0 -te $xmin $ymin $xmax $ymax -tr $xres $yres -of netCDF -init 1 shp/catchment_jan2021.shp helhmask_refined_v3.nc
ncap2 -s 'Band1=int(Band1)' helhmask_refined_v3.nc helhmask_refined_v3.nc -O
 #+END_SRC

#+NAME: add_ftt_mask
#+BEGIN_SRC bash
DATA=helhmask_refined_v3.nc

gdalwarp -of netCDF -t_srs "+proj=stere +lat_0=90 +lat_ts=70 +lon_0=-45 +k=1 +x_0=0 +y_0=0 +datum=WGS84 +units=m +no_defs" -r bilinear -te $xmin $ymin $xmax $ymax -tr $xres $yres NETCDF:${DATA}:Band1 tmp.nc -overwrite
ncks -A -v Band1 tmp.nc $WORKING 
ncap2 -O -s 'ftt_mask=int(Band1)' $WORKING $WORKING 
#ncap2 -s 'where(thk<0) thk=0' $WORKING $WORKING -O
#ncatted -a standard_name,$shortname,d,, $WORKING # remove it
#ncatted -O -a units,$shortname,o,c,"m" $WORKING
ncatted -O -a long_name,$ftt_mask,o,c,"Drainage basin area for regional modeling" $WORKING
rm tmp.nc
#+END_SRC



#+NAME: greenland_declutter
#+BEGIN_SRC bash
# de-clutter by only keeping vars we want

ncks -O -v bheatflx,topg,thk,precipitation,ice_surface_temp,climatic_mass_balance,ftt_mask,usurf $WORKING $WORKING
ncatted -O -a projection,global,c,c,"+proj=stere +lat_0=90 +lat_ts=70 +lon_0=-45 +k=1 +x_0=0 +y_0=0 +datum=WGS84 +units=m +no_defs " $WORKING

 #+END_SRC


#+BEGIN_SRC python :tangle fill_climate_values.py
import xarray as xr
import sys

infile =  sys.argv[1]

src = xr.open_dataset(infile+'.nc')
ds = src.copy()
ds['ice_surface_temp'] = src['ice_surface_temp'].fillna(-10)
ds['precipitation'] = src['precipitation'].fillna(0)

ds.to_netcdf(infile+'-filled.nc', format='NETCDF3_CLASSIC')
ds.close()
#+END_SRC

#+BEGIN_SRC python
import xarray as xr

infile =  'pism_greenland_1km_v2'

src = xr.open_dataset(infile+'.nc')
ds = src.copy()
ds['ice_surface_temp'] = src['ice_surface_temp'].fillna(-10)
ds['precipitation'] = src['precipitation'].fillna(0)

ds.to_netcdf(infile+'-filled.nc', format='NETCDF3_CLASSIC')
ds.close()
#+END_SRC

#+RESULTS:
:results:
# Out [9]: 
:end:

#+BEGIN_SRC bash
chmod 755 fill_climate_values.py
python fill_climate_values.py $WORKINGFILE 
#+END_SRC








***** 5 panels w. colors
#+begin_src python :results output


import xarray as xr
import matplotlib.pyplot as plt
import pandas as pd
<<load_IRD>> # composite
<<load_pism_forcing>> # temp, precip
temp = temp.resample('YE').mean()-273.15
precip = precip.resample('YE').sum()*(60*60*24*365)/1000 #unit is kg/s and this is converted to mm/year
autoterm = pd.read_csv('data/autoterm/Helheim.csv', index_col = 1, parse_dates=True)
autoterm = -autoterm['181'].resample('YE').median()
autoterm = autoterm/1000
ds = xr.open_dataset('data/solid_ice_discharge_obs/gate.nc')
flux_obs = ds.sel(gate=227)['discharge'].to_pandas()
flux_obs_annual = flux_obs.resample('YE').mean()


fig, ax = plt.subplots(5,1, figsize = (8,17), sharex = True)
axT = ax[0]
axP = ax[1]
axIRD = ax[2]
axCF = ax[3]
axSID = ax[4]

ird_color = 'gray'
flux_color = 'tab:cyan'
autoterm_color = 'tab:olive'
temp_color = 'tab:blue'
precip_color = 'tab:orange'
axT.plot(temp.index, temp, label = 'Air temperature', color = temp_color)
axT.set_ylabel('$\circ$C')
axT.legend(loc = 'upper left')
axP.plot(precip.index, precip, label = 'Precipitation', color = precip_color)
axP.set_ylabel('mm/yr')
axP.legend(loc = 'upper left')
axIRD.plot(composite.index, composite, label = 'Ice rafted debris', color = ird_color)
axIRD.set_ylabel('IRD')
axIRD.legend(loc = 'upper left')
axCF.scatter(autoterm.index, autoterm, label = 'Calving front position',color = autoterm_color)
axCF.axhline(y=0, color = 'gray', alpha = 0.5, linestyle='--', linewidth=1)
axCF.axhline(y=-4.6, color = 'gray', alpha = 0.5, linestyle='--', linewidth=1)
axCF.axhline(y=3.20, color = 'gray', alpha = 0.5, linestyle='--', linewidth=1)
xlim = axCF.get_xlim()
axCF.set_xlim(xlim[0], xlim[1] + 20)

# Add year labels just outside the right edge
axCF.text(xlim[1] + 40, 0, '1940', va='center', fontsize=9, color='gray')
axCF.text(xlim[1] + 40, -4.6, '1994', va='center', fontsize=9, color='gray')
axCF.text(xlim[1] + 40, 3.2, '2021', va='center', fontsize=9, color='gray')



axCF.set_ylabel('m')
axCF.legend(loc = 'upper left')
axSID.plot(flux_obs_annual.index, flux_obs_annual, label = 'Observed ice flux', color = flux_color)
axSID.set_ylabel('Gt/yr')
axSID.legend(loc = 'upper left')
plt.show()
fig.savefig('figures/paper/obsererved_timeseries.png', dpi = 300)
#+end_src

#+RESULTS:
: /tmp/babel-tgyfO8/python-hzfifu:62: SyntaxWarning: invalid escape sequence '\c'
:   axT.set_ylabel('$\circ$C')





***** 3 panels w. colors
#+begin_src python :results output


import xarray as xr
import matplotlib.pyplot as plt
import pandas as pd
<<load_IRD>> # composite
<<load_pism_forcing>> # temp, precip
temp = temp.resample('YE').mean()-273.15
precip = precip.resample('YE').sum()*(60*60*24*365)/1000 #unit is kg/s and this is converted to mm/year
autoterm = pd.read_csv('data/autoterm/Helheim.csv', index_col = 1, parse_dates=True)
autoterm = -autoterm['181'].resample('YE').median()
autoterm = autoterm/1000
ds = xr.open_dataset('data/solid_ice_discharge_obs/gate.nc')
flux_obs = ds.sel(gate=227)['discharge'].to_pandas()
flux_obs_annual = flux_obs.resample('YE').mean()


fig, ax = plt.subplots(3,1, figsize = (8,6), sharex = True)
axT = ax[0]
axP = axT.twinx()
axIRD = ax[1]
axCF = ax[2]
axSID = axCF.twinx()

# --- Panel labels (added here) ---
axT.text(0.02, 0.90, "(a)", transform=ax[0].transAxes,
           fontsize=12, fontweight="bold")
axIRD.text(0.02, 0.90, "(b)", transform=ax[1].transAxes,
           fontsize=12, fontweight="bold")
axCF.text(0.02, 0.90, "(c)", transform=ax[2].transAxes,
           fontsize=12, fontweight="bold")

ird_color = 'gray'
flux_color = 'tab:cyan'
autoterm_color = 'tab:olive'
temp_color = 'tab:blue'
precip_color = 'tab:orange'
axT.plot(temp.index, temp, label = '', color = temp_color, alpha = 0.3)
legT = axT.plot(temp.index, temp.rolling(12,center = True).mean(), label = 'Air temperature', color = temp_color)
axT.set_ylabel('$^\circ$ C')
#axT.legend(loc = 'upper left')
axP.plot(precip.index, precip, label = '', color = precip_color, alpha = 0.3)
legP = axP.plot(precip.index, precip.rolling(12,center = True).mean(), label = 'Precipitation', color = precip_color)
axP.set_ylabel('mm/yr')
axT.grid(True, alpha=0.3)
lines = legT + legP
labels = [l.get_label() for l in lines]

# Make one legend on the temperature axis
axT.legend(lines, labels, loc="lower left")

#axT.legend([legT,legP], ['Temp', 'Prec'])
axIRD.plot(composite.index, composite, label = 'Ice rafted debris', color = ird_color)
axIRD.set_ylabel('IRD')
axIRD.legend(loc = 'center left')
axIRD.grid(True, alpha=0.3)

legCF = axCF.scatter(autoterm.index, autoterm, label = 'Calving front position',color = autoterm_color)
#axCF.axhline(y=0, color = 'gray', alpha = 0.5, linestyle='--', linewidth=1)
#axCF.axhline(y=-4.6, color = 'gray', alpha = 0.5, linestyle='--', linewidth=1)
#axCF.axhline(y=3.20, color = 'gray', alpha = 0.5, linestyle='--', linewidth=1)
xlim = axCF.get_xlim()
axCF.set_xlim(xlim[0], xlim[1] + 20)
axCF.grid(True, alpha=0.3)

# Add year labels just outside the right edge
#axCF.text(xlim[1] + 40, 0, '1940', va='center', fontsize=9, color='gray')
#axCF.text(xlim[1] + 40, -4.6, '1994', va='center', fontsize=9, color='gray')
#axCF.text(xlim[1] + 40, 3.2, '2021', va='center', fontsize=9, color='gray')



axCF.set_ylabel('m')
#axCF.legend(loc = 'upper left')
legSID, = axSID.plot(flux_obs_annual.index, flux_obs_annual, label = 'Ice flux', color = flux_color)
axSID.set_ylabel('Gt/yr')
#axSID.legend(loc = 'upper right')

# Combine handles + labels
handles = [legCF, legSID]
labels = [h.get_label() for h in handles]

# Put the legend on the left axis (or use fig.legend to place it outside)
axCF.legend(handles, labels, loc='center left')



plt.show()
fig.savefig('figures/paper/observed_timeseries.png', dpi = 300)
#+end_src

#+RESULTS:
: /tmp/babel-A0aLcU/python-tWWtIc:71: SyntaxWarning: invalid escape sequence '\c'
:   axT.set_ylabel('$^\circ$ C')






**** Plot temperature and precipitation alone
#+begin_src python :results output
import xarray as xr
import matplotlib.pyplot as plt
import pandas as pd
<<load_IRD>> # composite
<<load_pism_forcing>> # temp, precip
temp = temp.resample('YE').mean()-273.15
precip = precip.resample('YE').sum()*(60*60*24*365)/1000 #unit is kg/s and this is converted to mm/year



fig, ax = plt.subplots(2,1, figsize = (8,4), sharex = True)
axT = ax[0]
axP = ax[1]

temp_color = 'tab:blue'
precip_color = 'tab:orange'
axT.plot(temp.index, temp, label = 'Air temperature', color = temp_color)
axT.set_ylabel('$\circ$C', fontsize = '16')
axT.legend(loc = 'upper left')
axP.plot(precip.index, precip, label = 'Precipitation', color = precip_color)
axP.set_ylabel('mm/yr', fontsize = '16')
axP.legend(loc = 'upper left')
axP.tick_params(axis='x', labelsize=16)
axP.tick_params(axis='y', labelsize=16)
axT.tick_params(axis='x', labelsize=16)
axT.tick_params(axis='y', labelsize=16)
axP.set_xlabel('Year', fontsize = '16')


fig.tight_layout()
plt.show()
fig.savefig('figures/paper/obsererved_timeseries_prec_temp.png', dpi = 300)
#+end_src

#+RESULTS:
: /tmp/babel-A0aLcU/python-o5yziP:49: SyntaxWarning: invalid escape sequence '\c'
:   axT.set_ylabel('$\circ$C', fontsize = '16')


**** Plot IRD, hindcast model and SID in top panel with calving front in lower panel the two selected models on top of each other
#+begin_src python :results output 
import xarray as xr
import matplotlib.pyplot as plt
import pandas as pd

# (your data loading code unchanged)
# ---------------------------------------------------------
<<<load_IRD>> # — assumed this sets up a DataFrame called 'composite' with a datetime index
<<load_pism_forcing>>
temp = temp.resample('YE').mean()-273.15
cycle6 = '6th'
model6 = 'control_6th_relax_E3_v4.2'

cycle7 = '7th'
model7 = 'control_7th_relax_E3_v4.2'


relax_model = 'relax_8th_cycle_E3_v4.2'

flux_model6 = pd.read_csv('csvs/flux_profiles/flux_'+model6+'.csv', index_col = 0, parse_dates=True)
flux_model7 = pd.read_csv('csvs/flux_profiles/flux_'+model7+'.csv', index_col = 0, parse_dates=True)
flux_relax = pd.read_csv('csvs/flux_profiles/flux_'+relax_model+'.csv', index_col = 0, parse_dates=True)

front_model6 = pd.read_csv('csvs/calving_front_position/calvingfront_position_'+model6+'.csv', index_col = 0, parse_dates = True)
front_model6 = front_model6 - (31400-2700) # correcting so that it is approximately distance from the same point (they have been alighned at the 1989 value  where I can see on QGIS that the calving
front_model6 = front_model6/1000

front_model7 = pd.read_csv('csvs/calving_front_position/calvingfront_position_'+model7+'.csv', index_col = 0, parse_dates = True)
front_model7 = front_model7 - (31400-2700) # correcting so that it is approximately distance from the same point (they have been alighned at the 1989 value  where I can see on QGIS that the calving
front_model7 = front_model7/1000

front_relax = pd.read_csv('csvs/calving_front_position/calvingfront_position_'+relax_model+'.csv', index_col = 0, parse_dates = True)
front_relax = front_relax - (31400-2700) # correcting so that it is approximately distance from the same point (they have been alighned at the 1989 value  where I can see on QGIS that the calving
front_relax = front_relax/1000


time_shift = 1897 - 1779 +1
front_relax.index = front_relax.index + pd.DateOffset(years = time_shift)
flux_relax.index = flux_relax.index  + pd.DateOffset(years = time_shift)
#temp_cold.index = temp_cold.index + pd.DateOffset(years = time_shift)




autoterm = pd.read_csv('data/autoterm/Helheim.csv', index_col = 1, parse_dates=True)
autoterm = -autoterm['181'].resample('YE').median()
autoterm = autoterm/1000

    

ds = xr.open_dataset('data/solid_ice_discharge_obs/gate.nc')
#flux_obs = ds.sel(gate=227)['discharge'].to_pandas()
#flux_obs_annual = flux_obs.resample('YE').mean()

flux_obs = ds.sel(gate=227)['discharge'].to_pandas()
flux_coverage = ds.sel(gate=227)['coverage'].to_pandas()
flux_obs = flux_obs.where(flux_coverage>0.8)
flux_obs_annual = flux_obs.resample('YE').mean()
# Define colors

ird_color = 'black'
flux_color = 'tab:cyan'
autoterm_color = 'tab:olive'
#bjork_color = 'tab:orange'
model6_color = 'tab:brown'
model7_color = 'tab:pink'

# all data reading ... unchanged
# ---------------------------------------------------------

# ===== Plotting =====

plt.rcParams.update({
    "font.size": 11,
    "axes.labelsize": 11,
    "axes.titlesize": 12,
    "legend.fontsize": 10,
    "xtick.labelsize": 10,
    "ytick.labelsize": 10,
})

fig, axs = plt.subplots(
    3, 1, figsize=(8, 6.2),
    sharex=True,
    gridspec_kw={"hspace": 0.25}
)

ax_top, ax_mid, ax_bot = axs

# ---------------------------------------------------------
# Panel (a): IRD composite
# ---------------------------------------------------------
ax_top.plot(composite.index, composite['composite'],
            color="black", lw=1.4, label="IRD")

ax_top.set_ylabel("g m$^{-2}$ yr$^{-2}$")
ax_top.grid(True, alpha=0.4)
ax_top.legend(loc="center left")
# Panel label
ax_top.text(0.02, 0.90, "(a)", transform=ax_top.transAxes,
            fontsize=12, fontweight="bold")

# ---------------------------------------------------------
# Panel (b): Ice flux
# ---------------------------------------------------------
ax_mid.scatter(flux_obs_annual.index, flux_obs_annual,
               color="tab:cyan", s=18, label="Observed")

ax_mid.plot(flux_model6.index, flux_model6,
            color='tab:brown', lw=1.4, label='6th Hindcast')
ax_mid.plot(flux_model7.index, flux_model7,
            color='tab:pink', lw=1.4, label='7th Hindcast')
ax_mid.plot(flux_relax.index, flux_relax,
            color='gray', alpha=0.8, lw=1.3, label='7th Control')

ax_mid.set_ylabel("Gt yr$^{-1}$")
ax_mid.set_ylim(10, 40)
ax_mid.grid(True, alpha=0.4)
ax_mid.legend(loc="center left")

ax_mid.text(0.02, 0.90, "(b)", transform=ax_mid.transAxes,
            fontsize=12, fontweight="bold")

# ---------------------------------------------------------
# Panel (c): Calving front position
# ---------------------------------------------------------
ax_bot.scatter(autoterm.index, autoterm,
               color="tab:olive", s=18, label="Observed front")

ax_bot.plot(front_model6.index, front_model6,
            color='tab:brown', lw=1.4, label='6th Hindcast')
ax_bot.plot(front_model7.index, front_model7,
            color='tab:pink', lw=1.4, label='7th Hindcast')
ax_bot.plot(front_relax.index, front_relax,
            color='gray', alpha=0.8, lw=1.3, label='7th Control')

ax_bot.set_ylabel("km")
ax_bot.set_xlabel("Year")

# Reference lines
ax_bot.axhline(0, color='gray', alpha=0.5, linestyle='--', lw=1)
ax_bot.axhline(-4.6, color='gray', alpha=0.5, linestyle='--', lw=1)
ax_bot.axhline(3.2, color='gray', alpha=0.5, linestyle='--', lw=1)

# Move right-side reference years a bit outward
xlim = ax_bot.get_xlim()
right_x = xlim[1] - xlim[1]*0.1 #+ (xlim[1] - xlim[0]) * 0.0

ax_bot.text(right_x, 0, "1940", va="center", color="gray")
ax_bot.text(right_x, -4.6, "1985", va="center", color="gray")
ax_bot.text(right_x, 3.2, "2021", va="center", color="gray")

ax_bot.grid(True, alpha=0.4)
ax_bot.legend( loc="center left")

ax_bot.text(0.02, 0.90, "(c)", transform=ax_bot.transAxes,
            fontsize=12, fontweight="bold")

# ---------------------------------------------------------
# Axes limits
# ---------------------------------------------------------
start = min(composite.index.min(), flux_obs_annual.index.min())
end   = max(composite.index.max(), flux_obs_annual.index.max())

for ax in axs:
    ax.set_xlim(start, end)
    ax.spines['top'].set_visible(False)
    ax.spines['right'].set_visible(False)

# ---------------------------------------------------------
# Final layout
# ---------------------------------------------------------
plt.tight_layout()
fig.savefig(
    "figures/paper/6th_and_7th_ird_vs_sid_vs_obs_fronts_vs_model_v42.png",
    dpi=300,
    bbox_inches="tight"
)
plt.show()


#+end_src

#+RESULTS:
: /tmp/babel-A0aLcU/python-A9gmxc:192: UserWarning: This figure includes Axes that are not compatible with tight_layout, so results might be incorrect.
:   plt.tight_layout()

#+begin_src python :results output 
import xarray as xr
import matplotlib.pyplot as plt
import pandas as pd

<<load_IRD>> # — assumed this sets up a DataFrame called 'composite' with a datetime index
<<load_pism_forcing>>
temp = temp.resample('YE').mean()-273.15
cycle6 = '6th'
model6 = 'control_6th_relax_E3_v4.2'

cycle7 = '7th'
model7 = 'control_7th_relax_E3_v4.2'


relax_model = 'relax_8th_cycle_E3_v4.2'

flux_model6 = pd.read_csv('csvs/flux_profiles/flux_'+model6+'.csv', index_col = 0, parse_dates=True)
flux_model7 = pd.read_csv('csvs/flux_profiles/flux_'+model7+'.csv', index_col = 0, parse_dates=True)
flux_relax = pd.read_csv('csvs/flux_profiles/flux_'+relax_model+'.csv', index_col = 0, parse_dates=True)

front_model6 = pd.read_csv('csvs/calving_front_position/calvingfront_position_'+model6+'.csv', index_col = 0, parse_dates = True)
front_model6 = front_model6 - (31400-2700) # correcting so that it is approximately distance from the same point (they have been alighned at the 1989 value  where I can see on QGIS that the calving
front_model6 = front_model6/1000

front_model7 = pd.read_csv('csvs/calving_front_position/calvingfront_position_'+model7+'.csv', index_col = 0, parse_dates = True)
front_model7 = front_model7 - (31400-2700) # correcting so that it is approximately distance from the same point (they have been alighned at the 1989 value  where I can see on QGIS that the calving
front_model7 = front_model7/1000

front_relax = pd.read_csv('csvs/calving_front_position/calvingfront_position_'+relax_model+'.csv', index_col = 0, parse_dates = True)
front_relax = front_relax - (31400-2700) # correcting so that it is approximately distance from the same point (they have been alighned at the 1989 value  where I can see on QGIS that the calving
front_relax = front_relax/1000


time_shift = 1897 - 1779 +1
front_relax.index = front_relax.index + pd.DateOffset(years = time_shift)
flux_relax.index = flux_relax.index  + pd.DateOffset(years = time_shift)
#temp_cold.index = temp_cold.index + pd.DateOffset(years = time_shift)




autoterm = pd.read_csv('data/autoterm/Helheim.csv', index_col = 1, parse_dates=True)
autoterm = -autoterm['181'].resample('YE').median()
autoterm = autoterm/1000

    

ds = xr.open_dataset('data/solid_ice_discharge_obs/gate.nc')
#flux_obs = ds.sel(gate=227)['discharge'].to_pandas()
#flux_obs_annual = flux_obs.resample('YE').mean()

flux_obs = ds.sel(gate=227)['discharge'].to_pandas()
flux_coverage = ds.sel(gate=227)['coverage'].to_pandas()
flux_obs = flux_obs.where(flux_coverage>0.8)
flux_obs_annual = flux_obs.resample('YE').mean()
# Define colors

ird_color = 'black'
flux_color = 'tab:cyan'
autoterm_color = 'tab:olive'
#bjork_color = 'tab:orange'
model6_color = 'tab:brown'
model7_color = 'tab:pink'

# Create plot
fig, axs = plt.subplots(3,1, figsize=(8, 5), sharex = True)
#ax0 = axs[0]
ax = axs[0]
#ax1 = ax.twinx()
ax2 = axs[2]
ax15 = axs[1]
# Plot IRD composite (left axis)
#ax0.set_title(figuretitle)
#ax0.plot(temp, color = 'tab:blue', label = 'Temperature')
#ax0.set_ylabel('$\circ$C', fontsize=11)
ax.plot(composite.index,composite['composite'], color=ird_color, label='IRD')

# Plot ice flux (right axis)
ax15.scatter(flux_obs_annual.index, flux_obs_annual, color=flux_color, label='Observed')
ax15.plot(flux_model6.index, flux_model6, color = model6_color, label = '6th Hindcast')
ax15.plot(flux_model7.index, flux_model7, color = model7_color, label = '7th Hindcast')
ax15.plot(flux_relax.index, flux_relax, color = 'gray', alpha = 0.8, label = '7th Control')
ax15.legend()
# Plot calving fronts lower panel
ax2.scatter(autoterm.index, autoterm, color = autoterm_color, label = 'Observed calving front')
#ax2.scatter(bjork.index, bjork['HubDist'], color = bjork_color, label = 'Bjørk et al., 2012')
ax2.plot(front_model6.index, front_model6, color = model6_color, label = '6th Hindcast')
ax2.plot(front_model7.index, front_model7, color = model7_color, label = '7th Hindcast')
ax2.plot(front_relax.index, front_relax, color = 'gray', alpha = 0.8, label = '7th Control')
ax2.legend()
# Set axis labels and colors
ax.set_ylabel('g m$^{⁻2}$ yr$^{⁻2}$', fontsize=11)
#ax.tick_params(axis='y', labelcolor=ird_color)
ax15.set_ylabel(' Gt/year', fontsize=11)
ax15.set_ylim(10,40)
#ax15.tick_params(axis='y', labelcolor=flux_color)
#ax15.set_ylim(15, 40)
ax2.set_ylabel('km', fontsize=11)
ax2.set_xlabel('Year', fontsize=11)


ax2.scatter(autoterm.index, autoterm, label = 'Calving front position',color = autoterm_color)
ax2.axhline(y=0, color = 'gray', alpha = 0.5, linestyle='--', linewidth=1)
ax2.axhline(y=-4.6, color = 'gray', alpha = 0.5, linestyle='--', linewidth=1)
ax2.axhline(y=3.20, color = 'gray', alpha = 0.5, linestyle='--', linewidth=1)
xlim = ax2.get_xlim()
ax2.set_xlim(xlim[0], xlim[1] + 20)

# Add year labels just outside the right edge
ax2.text(xlim[1] + 40, 0, '1940', va='center', fontsize=9, color='gray')
ax2.text(xlim[1] + 40, -4.6, '1994', va='center', fontsize=9, color='gray')
ax2.text(xlim[1] + 40, 3.2, '2021', va='center', fontsize=9, color='gray')

# Color the spines to match the data
#for spine in ['left', 'bottom']:
#    ax.spines[spine].set_color(ird_color)
#for spine in ['right']:
#    ax1.spines[spine].set_color(flux_color)

#ax0.tick_params(axis='x', labelsize=16)
#ax0.tick_params(axis='y', labelsize=11)
ax.tick_params(axis='x', labelsize=11)
ax.tick_params(axis='y', labelsize=11)
ax15.tick_params(axis='x', labelsize=11)
ax15.tick_params(axis='y', labelsize=11)
ax2.tick_params(axis='x', labelsize=11)
ax2.tick_params(axis='y', labelsize=11)

# Hide unused spines
#ax0.spines['top'].set_visible(False)
#ax0.spines['right'].set_visible(False)
ax.spines['top'].set_visible(False)
ax15.spines['top'].set_visible(False)
ax2.spines['top'].set_visible(False)
#ax1.spines['left'].set_visible(False)
ax15.spines['right'].set_visible(False)
ax.spines['right'].set_visible(False)
ax2.spines['right'].set_visible(False)
#ax0.grid(True)
ax.grid(True)
ax15.grid(True)
ax2.grid(True)
# Set x-axis limits to cover both datasets
start = min(composite.index.min(), flux_obs_annual.index.min())
end = max(composite.index.max(), flux_obs_annual.index.max())
ax.set_xlim(start, end)
ax2.set_xlim(start, end)
plt.tight_layout()
fig.savefig('figures/paper/6th_and_7th_ird_vs_sid_vs_obs_fronts_vs_model_v42.png', dpi = 300)
plt.show()
#+end_src

#+RESULTS:




